Билет16/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет16/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет16/src/InformationRegisters/УсловияКредита/УсловияКредита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УсловияКредита</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СуммаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокКредитаВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Билет16/src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//старая метода из-за блокировки
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Записать();
	Движения.Взаиморасчеты.Записывать = Истина;
	
	//Блокировкад  
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
	ЭлементБлокировки.УстановитьЗначение("Контрагент", Контрагент);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	//два запроса 1-для суммы долга(остаток) 2-для получения суммы и срока кредита
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(УсловияКредитаСрезПоследних.СуммаКредита, 0) КАК СуммаКредита,
	|	ЕСТЬNULL(УсловияКредитаСрезПоследних.СрокКредитаВДнях, 0) КАК СрокКредитаВДнях
	|ИЗ
	|	РегистрСведений.УсловияКредита.СрезПоследних(&МоментВремени, Контрагент = &Контрагент) КАК УсловияКредитаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВзаиморасчетыОстатки.СуммаДолгаОстаток),0) КАК СуммаДолга,
	|	ЕСТЬNULL(МИНИМУМ(ВзаиморасчетыОстатки.Накладная.Дата), Датавремя(1,1,1)) КАК НачалоКредита
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапросаМассив = Запрос.ВыполнитьПакет();
	
	ВыборкаКредит = РезультатЗапросаМассив[0].Выбрать();
	
	ВыборкаКредит.Следующий();
	
	Выборка = РезультатЗапросаМассив[1].Выбрать();
	Выборка.Следующий();  
	Если ВыборкаКредит.СуммаКредита = 0 ИЛИ ВыборкаКредит.СрокКредитаВДнях = 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не назначены условия кредита для контрагента";
		Сообщение.Сообщить();
	КонецЕсли;
	//если есть запись сравниваем иначе ругаемся
	Если ЗначениеЗаполнено(ВыборкаКредит.СуммаКредита) Тогда
		Если ВыборкаКредит.СуммаКредита < Выборка.СуммаДолга + СуммаПоДокументу Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Превышен лимит кредита";
			Сообщение.Сообщить();	  
		КонецЕсли; 
	Иначе
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не назначены условия кредита для контрагента";
		Сообщение.Сообщить();
	КонецЕсли;
	//если есть дата выдачи кредита сравниваем
	Если ЗначениеЗаполнено(Выборка.НачалоКредита) Тогда
		Если Выборка.НачалоКредита + ВыборкаКредит.СрокКредитаВДнях *24 * 60 *60 < Дата Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Превышен срок кредита";
			Сообщение.Сообщить();	  
		КонецЕсли; 	
	КонецЕсли;
    //если прошли все проверки - проводим
	Движение = Движения.Взаиморасчеты.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Накладная = Ссылка;
	Движение.СуммаДолга = СуммаПоДокументу;
КонецПроцедуры
